<details>
<summary>Execution result of "run-all plan" in "aws"</summary>

```terraform
04:41:46.350 INFO   The stack at /github/workspace/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc


04:41:46.522 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/aws/management/north-virginia/vpc/.terragrunt-cache/imz023Fez9MTqVLA3D1zXZstqKA/A35GeYiqYDYXDWZftKtd1kkU5ic
04:41:46.529 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/aws/management/north-virginia/aws_organization/.terragrunt-cache/4nvNqm3hQHYqU8MXTsGFuPgIyKE/kLn2nKw80j_MBMKRZUlBCyiMAms
04:41:46.860 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
04:41:47.048 STDOUT [management/north-virginia/aws_organization] tofu: 
04:41:47.049 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
04:41:47.049 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
04:41:47.104 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
04:41:47.194 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
04:41:47.195 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
04:41:47.220 STDOUT [management/north-virginia/vpc] tofu: 
04:41:47.220 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
04:41:47.220 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
04:41:47.317 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
04:41:47.317 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
04:41:47.706 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.92.0...
04:41:47.742 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.92.0...
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
04:41:51.663 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
04:41:51.707 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu used the selected providers to generate the following execution
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: plan. Resource actions are indicated with the following symbols:
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:   + create
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu will perform the following actions:
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:   # aws_organizations_organization.org will be created
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:   + resource "aws_organizations_organization" "org" {
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + accounts                      = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + arn                           = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + aws_service_access_principals = [
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:           + "cloudtrail.amazonaws.com",
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:           + "config.amazonaws.com",
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:         ]
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + feature_set                   = "ALL"
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + id                            = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_arn            = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_email          = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_id             = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_name           = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + non_master_accounts           = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:       + roots                         = (known after apply)
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:     }
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: 
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu: Changes to Outputs:
04:41:54.928 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_arn               = (known after apply)
04:41:54.929 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_id                = (known after apply)
04:41:54.929 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_master_account_id = (known after apply)
04:41:54.929 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_roots             = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu: OpenTofu used the selected providers to generate the following execution
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu: plan. Resource actions are indicated with the following symbols:
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:   + create
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu: OpenTofu will perform the following actions:
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_network_acl.this[0] will be created
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_network_acl" "this" {
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + default_network_acl_id = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + egress {
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + action          = "allow"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + from_port       = 0
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + protocol        = "-1"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + rule_no         = 101
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + to_port         = 0
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:       + egress {
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + action     = "allow"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + from_port  = 0
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + protocol   = "-1"
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + rule_no    = 100
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:           + to_port    = 0
04:41:55.111 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ingress {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + action          = "allow"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + from_port       = 0
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + protocol        = "-1"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + rule_no         = 101
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + to_port         = 0
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ingress {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + action     = "allow"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + from_port  = 0
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + protocol   = "-1"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + rule_no    = 100
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + to_port    = 0
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_route_table.default[0] will be created
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_route_table" "default" {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + default_route_table_id = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + route                  = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + update = "5m"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_security_group.this[0] will be created
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_security_group" "this" {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + description            = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + egress                 = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ingress                = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + name                   = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + name_prefix            = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + revoke_rules_on_delete = false
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[0] will be created
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1a"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1a"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[1] will be created
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1b"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1b"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
04:41:55.112 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[2] will be created
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
04:41:55.116 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_internet_gateway.this[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_internet_gateway" "this" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + arn      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id       = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + owner_id = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags     = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id   = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1a"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1a"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[1] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1b"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1b"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[2] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[1] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[2] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.public_internet_gateway[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "public_internet_gateway" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + gateway_id             = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1a"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1a"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[1] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1b"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1b"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[2] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1c"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.public[0] will be created
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "public" {
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
04:41:55.117 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[0] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[1] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[2] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[0] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[1] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[2] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[0] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1a"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.1.0/24"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1a"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1a"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[1] will be created
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1b"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.2.0/24"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1b"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1b"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.118 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[2] will be created
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1c"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.3.0/24"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1c"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1c"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.119 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[0] will be created
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1a"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.101.0/24"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1a"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1a"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.121 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[1] will be created
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1b"
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.102.0/24"
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.124 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1b"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1b"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[2] will be created
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1c"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.103.0/24"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1c"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1c"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   # aws_vpc.this[0] will be created
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_vpc" "this" {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + arn                                  = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                           = "10.0.0.0/16"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + default_network_acl_id               = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + default_route_table_id               = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + default_security_group_id            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + dhcp_options_id                      = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns_hostnames                 = true
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns_support                   = true
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + enable_network_address_usage_metrics = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + id                                   = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + instance_tenancy                     = "default"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_association_id                  = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block                      = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_network_border_group = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + main_route_table_id                  = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                             = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags                                 = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                             = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   # aws_vpn_gateway.this[0] will be created
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_vpn_gateway" "this" {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + amazon_side_asn = "64512"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + arn             = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + id              = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags            = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + tags_all        = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id          = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu: Plan: 32 to add, 0 to change, 0 to destroy.
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu: 
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu: Changes to Outputs:
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + azs                                         = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1a",
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1b",
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1c",
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + cgw_arns                                    = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + cgw_ids                                     = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_nat_gateway_route_ids              = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_association_ids        = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_ids                    = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_arns                        = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_objects                     = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets                            = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_cidr_blocks                = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_ipv6_cidr_blocks           = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + default_network_acl_id                      = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + default_route_table_id                      = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + default_security_group_id                   = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_association_ids     = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_ids                 = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_arns                     = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_objects                  = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets                         = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_cidr_blocks             = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_ipv6_cidr_blocks        = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + igw_arn                                     = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + igw_id                                      = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_association_ids           = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_ids                       = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_arns                           = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_objects                        = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets                               = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_cidr_blocks                   = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_ipv6_cidr_blocks              = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + name                                        = "my-vpc"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + nat_ids                                     = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + nat_public_ips                              = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + natgw_ids                                   = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + natgw_interface_ids                         = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_arns                         = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_objects                      = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets                             = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_cidr_blocks                 = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_ipv6_cidr_blocks            = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_ipv6_egress_route_ids               = []
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_association_ids         = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_ids                     = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_arns                         = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_objects                      = [
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1a"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.1.0/24"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1a"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1a"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.125 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.2.0/24"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.3.0/24"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets                             = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_cidr_blocks                 = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.1.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.2.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.3.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_ipv6_cidr_blocks            = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_internet_gateway_route_id            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_association_ids          = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_ids                      = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_arns                          = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_objects                       = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1a"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.101.0/24"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1a"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1a"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.102.0/24"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1b"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.103.0/24"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1c"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:             }
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:         },
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets                              = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_cidr_blocks                  = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.101.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.102.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.103.0/24",
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_ipv6_cidr_blocks             = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_public_route_table_association_ids = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_association_ids        = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_ids                    = [
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:     ]
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_arns                        = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_objects                     = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets                            = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_cidr_blocks                = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_ipv6_cidr_blocks           = []
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + this_customer_gateway                       = {}
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vgw_arn                                     = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vgw_id                                      = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_arn                                     = (known after apply)
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_block_public_access_exclusions          = {}
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_cidr_block                              = "10.0.0.0/16"
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_enable_dns_hostnames                    = true
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_enable_dns_support                      = true
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
04:41:55.126 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_arn                = ""
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_id                                      = (known after apply)
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_instance_tenancy                        = "default"
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_ipv6_association_id                     = (known after apply)
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_ipv6_cidr_block                         = (known after apply)
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_main_route_table_id                     = (known after apply)
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_owner_id                                = (known after apply)
04:41:55.127 STDOUT [management/north-virginia/vpc] tofu:   + vpc_secondary_cidr_blocks                   = []
```

</details>
    
